zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f403z(k-i-g-e-c-b)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32f403xx-afio.h"

/* ADC012_IN0 */
#define ADC012_IN0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)

/* ADC012_IN1 */
#define ADC012_IN1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)

/* ADC012_IN2 */
#define ADC012_IN2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)

/* ADC012_IN3 */
#define ADC012_IN3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)
#define ANALOG_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)
#define ANALOG_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)
#define ANALOG_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)
#define ANALOG_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)
#define ANALOG_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)
#define ANALOG_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)
#define ANALOG_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)
#define ANALOG_PA8 \
	GD32_PINMUX_AFIO('A', 8, ANALOG, NORMP)
#define ANALOG_PA9 \
	GD32_PINMUX_AFIO('A', 9, ANALOG, NORMP)
#define ANALOG_PA10 \
	GD32_PINMUX_AFIO('A', 10, ANALOG, NORMP)
#define ANALOG_PA11 \
	GD32_PINMUX_AFIO('A', 11, ANALOG, NORMP)
#define ANALOG_PA12 \
	GD32_PINMUX_AFIO('A', 12, ANALOG, NORMP)
#define ANALOG_PA13 \
	GD32_PINMUX_AFIO('A', 13, ANALOG, NORMP)
#define ANALOG_PA14 \
	GD32_PINMUX_AFIO('A', 14, ANALOG, NORMP)
#define ANALOG_PA15 \
	GD32_PINMUX_AFIO('A', 15, ANALOG, NORMP)
#define ANALOG_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)
#define ANALOG_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)
#define ANALOG_PB2 \
	GD32_PINMUX_AFIO('B', 2, ANALOG, NORMP)
#define ANALOG_PB3 \
	GD32_PINMUX_AFIO('B', 3, ANALOG, NORMP)
#define ANALOG_PB4 \
	GD32_PINMUX_AFIO('B', 4, ANALOG, NORMP)
#define ANALOG_PB5 \
	GD32_PINMUX_AFIO('B', 5, ANALOG, NORMP)
#define ANALOG_PB6 \
	GD32_PINMUX_AFIO('B', 6, ANALOG, NORMP)
#define ANALOG_PB7 \
	GD32_PINMUX_AFIO('B', 7, ANALOG, NORMP)
#define ANALOG_PD0 \
	GD32_PINMUX_AFIO('D', 0, ANALOG, NORMP)
#define ANALOG_PD1 \
	GD32_PINMUX_AFIO('D', 1, ANALOG, NORMP)
#define ANALOG_PD2 \
	GD32_PINMUX_AFIO('D', 2, ANALOG, NORMP)
#define ANALOG_PD3 \
	GD32_PINMUX_AFIO('D', 3, ANALOG, NORMP)
#define ANALOG_PD4 \
	GD32_PINMUX_AFIO('D', 4, ANALOG, NORMP)
#define ANALOG_PD5 \
	GD32_PINMUX_AFIO('D', 5, ANALOG, NORMP)
#define ANALOG_PD6 \
	GD32_PINMUX_AFIO('D', 6, ANALOG, NORMP)
#define ANALOG_PD7 \
	GD32_PINMUX_AFIO('D', 7, ANALOG, NORMP)
#define ANALOG_PD8 \
	GD32_PINMUX_AFIO('D', 8, ANALOG, NORMP)
#define ANALOG_PD9 \
	GD32_PINMUX_AFIO('D', 9, ANALOG, NORMP)
#define ANALOG_PD10 \
	GD32_PINMUX_AFIO('D', 10, ANALOG, NORMP)
#define ANALOG_PD11 \
	GD32_PINMUX_AFIO('D', 11, ANALOG, NORMP)
#define ANALOG_PD12 \
	GD32_PINMUX_AFIO('D', 12, ANALOG, NORMP)
#define ANALOG_PD13 \
	GD32_PINMUX_AFIO('D', 13, ANALOG, NORMP)
#define ANALOG_PD14 \
	GD32_PINMUX_AFIO('D', 14, ANALOG, NORMP)
#define ANALOG_PD15 \
	GD32_PINMUX_AFIO('D', 15, ANALOG, NORMP)
#define ANALOG_PE0 \
	GD32_PINMUX_AFIO('E', 0, ANALOG, NORMP)
#define ANALOG_PE1 \
	GD32_PINMUX_AFIO('E', 1, ANALOG, NORMP)
#define ANALOG_PE2 \
	GD32_PINMUX_AFIO('E', 2, ANALOG, NORMP)
#define ANALOG_PE3 \
	GD32_PINMUX_AFIO('E', 3, ANALOG, NORMP)
#define ANALOG_PE4 \
	GD32_PINMUX_AFIO('E', 4, ANALOG, NORMP)
#define ANALOG_PE5 \
	GD32_PINMUX_AFIO('E', 5, ANALOG, NORMP)
#define ANALOG_PE6 \
	GD32_PINMUX_AFIO('E', 6, ANALOG, NORMP)
#define ANALOG_PE7 \
	GD32_PINMUX_AFIO('E', 7, ANALOG, NORMP)
#define ANALOG_PE8 \
	GD32_PINMUX_AFIO('E', 8, ANALOG, NORMP)
#define ANALOG_PE9 \
	GD32_PINMUX_AFIO('E', 9, ANALOG, NORMP)
#define ANALOG_PE10 \
	GD32_PINMUX_AFIO('E', 10, ANALOG, NORMP)
#define ANALOG_PE11 \
	GD32_PINMUX_AFIO('E', 11, ANALOG, NORMP)
#define ANALOG_PE12 \
	GD32_PINMUX_AFIO('E', 12, ANALOG, NORMP)
#define ANALOG_PE13 \
	GD32_PINMUX_AFIO('E', 13, ANALOG, NORMP)
#define ANALOG_PE14 \
	GD32_PINMUX_AFIO('E', 14, ANALOG, NORMP)
#define ANALOG_PE15 \
	GD32_PINMUX_AFIO('E', 15, ANALOG, NORMP)
#define ANALOG_PF0 \
	GD32_PINMUX_AFIO('F', 0, ANALOG, NORMP)
#define ANALOG_PF1 \
	GD32_PINMUX_AFIO('F', 1, ANALOG, NORMP)
#define ANALOG_PF2 \
	GD32_PINMUX_AFIO('F', 2, ANALOG, NORMP)
#define ANALOG_PF3 \
	GD32_PINMUX_AFIO('F', 3, ANALOG, NORMP)
#define ANALOG_PF4 \
	GD32_PINMUX_AFIO('F', 4, ANALOG, NORMP)
#define ANALOG_PF5 \
	GD32_PINMUX_AFIO('F', 5, ANALOG, NORMP)
#define ANALOG_PF6 \
	GD32_PINMUX_AFIO('F', 6, ANALOG, NORMP)
#define ANALOG_PF7 \
	GD32_PINMUX_AFIO('F', 7, ANALOG, NORMP)
#define ANALOG_PF8 \
	GD32_PINMUX_AFIO('F', 8, ANALOG, NORMP)
#define ANALOG_PF9 \
	GD32_PINMUX_AFIO('F', 9, ANALOG, NORMP)
#define ANALOG_PF10 \
	GD32_PINMUX_AFIO('F', 10, ANALOG, NORMP)
#define ANALOG_PF11 \
	GD32_PINMUX_AFIO('F', 11, ANALOG, NORMP)
#define ANALOG_PF12 \
	GD32_PINMUX_AFIO('F', 12, ANALOG, NORMP)
#define ANALOG_PF13 \
	GD32_PINMUX_AFIO('F', 13, ANALOG, NORMP)
#define ANALOG_PF14 \
	GD32_PINMUX_AFIO('F', 14, ANALOG, NORMP)
#define ANALOG_PF15 \
	GD32_PINMUX_AFIO('F', 15, ANALOG, NORMP)
#define ANALOG_PG0 \
	GD32_PINMUX_AFIO('G', 0, ANALOG, NORMP)
#define ANALOG_PG1 \
	GD32_PINMUX_AFIO('G', 1, ANALOG, NORMP)
#define ANALOG_PG2 \
	GD32_PINMUX_AFIO('G', 2, ANALOG, NORMP)
#define ANALOG_PG3 \
	GD32_PINMUX_AFIO('G', 3, ANALOG, NORMP)
#define ANALOG_PG4 \
	GD32_PINMUX_AFIO('G', 4, ANALOG, NORMP)
#define ANALOG_PG5 \
	GD32_PINMUX_AFIO('G', 5, ANALOG, NORMP)
#define ANALOG_PG6 \
	GD32_PINMUX_AFIO('G', 6, ANALOG, NORMP)
#define ANALOG_PG7 \
	GD32_PINMUX_AFIO('G', 7, ANALOG, NORMP)
#define ANALOG_PG8 \
	GD32_PINMUX_AFIO('G', 8, ANALOG, NORMP)
#define ANALOG_PG9 \
	GD32_PINMUX_AFIO('G', 9, ANALOG, NORMP)
#define ANALOG_PG10 \
	GD32_PINMUX_AFIO('G', 10, ANALOG, NORMP)
#define ANALOG_PG11 \
	GD32_PINMUX_AFIO('G', 11, ANALOG, NORMP)
#define ANALOG_PG12 \
	GD32_PINMUX_AFIO('G', 12, ANALOG, NORMP)
#define ANALOG_PG13 \
	GD32_PINMUX_AFIO('G', 13, ANALOG, NORMP)
#define ANALOG_PG14 \
	GD32_PINMUX_AFIO('G', 14, ANALOG, NORMP)
#define ANALOG_PG15 \
	GD32_PINMUX_AFIO('G', 15, ANALOG, NORMP)

/* CAN0_RX */
#define CAN0_RX_PA11_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, CAN0_NORMP)
#define CAN0_RX_PD0_FRMP \
	GD32_PINMUX_AFIO('D', 0, GPIO_IN, CAN0_FRMP)

/* CAN0_TX */
#define CAN0_TX_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, CAN0_NORMP)
#define CAN0_TX_PD1_FRMP \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, CAN0_FRMP)

/* CAN1_RX */
#define CAN1_RX_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, CAN1_RMP)

/* CAN1_TX */
#define CAN1_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, CAN1_RMP)

